
#+begin_src shell
grep -o -P -e '([a-z_A-Z]+)' ~/2024/08/20/self-similar/ocaml-rust-unification/src/ocaml_types.json | sort | uniq -c | sort -n
#+end_src

#+RESULTS:
|   1 | Abstract                          |
|   1 | Clone                             |
|   1 | constraints                       |
|   1 | Contravariant                     |
|   1 | Covariant                         |
|   1 | deserialize_constructor_arguments |
|   1 | deserialize_core_type_desc        |
|   1 | deserialize_ptype_kind            |
|   1 | deserialize_signature_item        |
|   1 | expr                              |
|   1 | Immutable                         |
|   1 | Injective                         |
|   1 | items                             |
|   1 | kind                              |
|   1 | Lapply                            |
|   1 | Ldot                              |
|   1 | Lident                            |
|   1 | location                          |
|   1 | longident                         |
|   1 | manifest                          |
|   1 | Mmutable                          |
|   1 | ModuleExpr                        |
|   1 | mutable                           |
|   1 | NoInjectivity                     |
|   1 | NonRecursive                      |
|   1 | NoVariance                        |
|   1 | Open                              |
|   1 | open_infos                        |
|   1 | PartialEq                         |
|   1 | payload                           |
|   1 | pcd_args                          |
|   1 | pcd_attributes                    |
|   1 | pcd_name                          |
|   1 | pcd_res                           |
|   1 | pcd_vars                          |
|   1 | pconst_desc                       |
|   1 | PconstString                      |
|   1 | pexp_attributes                   |
|   1 | PexpConstant                      |
|   1 | pexp_desc                         |
|   1 | pld_attributes                    |
|   1 | pld_mutable                       |
|   1 | pld_name                          |
|   1 | pld_type                          |
|   1 | PmodApply                         |
|   1 | PmodApplyUnit                     |
|   1 | pmod_attributes                   |
|   1 | PmodConstraint                    |
|   1 | pmod_desc                         |
|   1 | PmodExtension                     |
|   1 | PmodFunctor                       |
|   1 | PmodIdent                         |
|   1 | PmodStructure                     |
|   1 | PmodUnpack                        |
|   1 | PSig                              |
|   1 | PsigAttribute                     |
|   1 | psig_desc                         |
|   1 | PsigOpen                          |
|   1 | PsigType                          |
|   1 | PStr                              |
|   1 | pstr_desc                         |
|   1 | PstrEval                          |
|   1 | PTyp                              |
|   1 | ptyp_attributes                   |
|   1 | PtypConstr                        |
|   1 | ptyp_desc                         |
|   1 | ptype_attributes                  |
|   1 | ptype_cstrs                       |
|   1 | ptype_kind                        |
|   1 | ptype_manifest                    |
|   1 | ptype_name                        |
|   1 | ptype_params                      |
|   1 | Recursive                         |
|   1 | res                               |
|   1 | Serialize                         |
|   1 | shebang                           |
|   1 | txt                               |
|   1 | type_                             |
|   1 | Variant                           |
|   1 | vars                              |
|   1 | visitor                           |
|   2 | Constant                          |
|   2 | ConstantDesc                      |
|   2 | ConstructorArguments              |
|   2 | ConstructorDeclaration            |
|   2 | content                           |
|   2 | CoreTypeDesc                      |
|   2 | elems                             |
|   2 | eq_token                          |
|   2 | Expression                        |
|   2 | ExpressionDesc                    |
|   2 | Injectivity                       |
|   2 | Mod                               |
|   2 | mod_token                         |
|   2 | ModuleExprDesc                    |
|   2 | MutableFlag                       |
|   2 | OpenDescription                   |
|   2 | OpenInfos                         |
|   2 | Payload                           |
|   2 | RecFlag                           |
|   2 | Record                            |
|   2 | semi                              |
|   2 | Signature                         |
|   2 | SignatureItem                     |
|   2 | SignatureItemDesc                 |
|   2 | Structure                         |
|   2 | StructureItem                     |
|   2 | StructureItemDesc                 |
|   2 | TypeDeclaration                   |
|   2 | TypeKind                          |
|   2 | type_token                        |
|   2 | unsafety                          |
|   2 | Variance                          |
|   3 | Box                               |
|   3 | LabelDeclaration                  |
|   3 | Option                            |
|   3 | Tuple                             |
|   4 | deserialize_with                  |
|   4 | Location                          |
|   4 | name                              |
|   5 | deserialize                       |
|   5 | LocString                         |
|   6 | CoreType                          |
|   6 | desc                              |
|   6 | LongIdent                         |
|   7 | attributes                        |
|   9 | Attribute                         |
|  12 | String                            |
|  14 | Enum                              |
|  14 | enum_token                        |
|  14 | named                             |
|  14 | Named                             |
|  14 | Struct                            |
|  14 | struct_token                      |
|  14 | variants                          |
|  16 | semi_token                        |
|  17 | unnamed                           |
|  17 | Unnamed                           |
|  19 | paren_token                       |
|  20 | Vec                               |
|  21 | allow                             |
|  21 | dead_code                         |
|  23 | Unit                              |
|  24 | rename                            |
|  26 | AngleBracketed                    |
|  26 | colon                             |
|  26 | _token                            |
|  27 | args                              |
|  27 | Deserialize                       |
|  28 | brace_token                       |
|  28 | Debug                             |
|  28 | derive                            |
|  28 | Joint                             |
|  28 | lit                               |
|  28 | Literal                           |
|  28 | Type                              |
|  29 | Public                            |
|  30 | generics                          |
|  30 | where_clause                      |
|  31 | params                            |
|  32 | Some                              |
|  40 | discriminant                      |
|  54 | fields                            |
|  56 | colon_token                       |
|  56 | gt_token                          |
|  56 | lt_token                          |
|  56 | mutability                        |


|  56 | serde                             |
|  58 | ty                                |
|  59 | Inherited                         |
|  77 | bracket_token                     |
|  77 | delimiter                         |
|  77 | List                              |
|  77 | MacroDelimiter                    |
|  77 | meta                              |
|  77 | MetaList                          |
|  77 | Outer                             |
|  77 | PathArguments                     |
|  77 | PathSegment                       |
|  77 | pound_token                       |
|  77 | style                             |
|  77 | tokens                            |
|  77 | TokenStream                       |
|  86 | Alone                             |
|  88 | qself                             |



|  88 | vis                               |
| 114 | char                              |
| 114 | Punct                             |
| 114 | spacing                           |
| 129 | attrs                             |
| 154 | Paren                             |
| 165 | arguments                         |
| 165 | leading_colon                     |
| 165 | path                              |
| 165 | Path                              |
| 165 | segments                          |
| 191 | inner                             |
| 191 | last                              |
| 244 | Ident                             |
| 244 | sym                               |
| 246 | spans                             |
| 293 | ident                             |
| 300 | None                              |
| 429 | null                              |
| 571 | span                              |
| 817 | bytes                             |



#+begin_src shell
gron ~/2024/08/20/self-similar/ocaml-rust-unification/src/ocaml_types.json| cut -d= -f1 | sed -e's/[0-9]/N/g' | grep "\.Enum" | sort | uniq -c | sort -n | tail -100
#+end_src

#+RESULTS:
|  6 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty.Path.path.segments.last.arguments.AngleBracketed.args.last.Type.Path.path.segments.last.ident |
|  6 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty.Path.path.segments.last.arguments.AngleBracketed.args.last.Type.Path.qself                    |
|  6 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty.Path.path.segments.last.arguments.AngleBracketed.colonN_token                                 |
|  6 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty.Path.path.segments.last.arguments.AngleBracketed.gt_token                                     |
|  6 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty.Path.path.segments.last.arguments.AngleBracketed.gt_token.spans                               |
|  6 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty.Path.path.segments.last.arguments.AngleBracketed.lt_token                                     |
|  6 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty.Path.path.segments.last.arguments.AngleBracketed.lt_token.spans                               |
|  7 | json.items[N].Enum.attrs[N]                                                                                                                                          |
|  7 | json.items[N].Enum.attrs[N].bracket_token                                                                                                                            |
|  7 | json.items[N].Enum.attrs[N].bracket_token.span                                                                                                                       |
|  7 | json.items[N].Enum.attrs[N].meta                                                                                                                                     |
|  7 | json.items[N].Enum.attrs[N].meta.List                                                                                                                                |
|  7 | json.items[N].Enum.attrs[N].pound_token                                                                                                                              |
|  7 | json.items[N].Enum.attrs[N].pound_token.spans                                                                                                                        |
|  7 | json.items[N].Enum.attrs[N].style                                                                                                                                    |
|  8 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed                                                                                                               |
|  8 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.paren_token                                                                                                   |
|  8 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.paren_token.span                                                                                              |
|  8 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.unnamed                                                                                                       |
|  8 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.unnamed.inner                                                                                                 |
|  8 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last                                                                                                  |
|  8 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.attrs                                                                                            |
|  8 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.colon_token                                                                                      |
|  8 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ident                                                                                            |
|  8 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.mutability                                                                                       |
|  8 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty                                                                                               |
|  8 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty.Path                                                                                          |
|  8 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty.Path.path                                                                                     |
|  8 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty.Path.path.leading_colon                                                                       |
|  8 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty.Path.path.segments                                                                            |
|  8 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty.Path.path.segments.inner                                                                      |
|  8 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty.Path.path.segments.last                                                                       |
|  8 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty.Path.path.segments.last.arguments                                                             |
|  8 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty.Path.path.segments.last.ident                                                                 |
|  8 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty.Path.qself                                                                                    |
|  8 | json.items[N].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.vis                                                                                              |
|  8 | json.items[NN].Enum.variants.inner[N][N].fields.Unnamed.unnamed.inner[N][N]                                                                                          |
|  9 | json.items[NN].Enum.variants.inner[N][N].fields.Unnamed                                                                                                              |
|  9 | json.items[NN].Enum.variants.inner[N][N].fields.Unnamed.paren_token                                                                                                  |
|  9 | json.items[NN].Enum.variants.inner[N][N].fields.Unnamed.paren_token.span                                                                                             |
|  9 | json.items[NN].Enum.variants.inner[N][N].fields.Unnamed.unnamed                                                                                                      |
|  9 | json.items[NN].Enum.variants.inner[N][N].fields.Unnamed.unnamed.inner                                                                                                |
|  9 | json.items[NN].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last                                                                                                 |
|  9 | json.items[NN].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.attrs                                                                                           |
|  9 | json.items[NN].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.colon_token                                                                                     |
|  9 | json.items[NN].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ident                                                                                           |
|  9 | json.items[NN].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.mutability                                                                                      |
|  9 | json.items[NN].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty                                                                                              |
|  9 | json.items[NN].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty.Path                                                                                         |
|  9 | json.items[NN].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty.Path.path                                                                                    |
|  9 | json.items[NN].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty.Path.path.leading_colon                                                                      |
|  9 | json.items[NN].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty.Path.path.segments                                                                           |
|  9 | json.items[NN].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty.Path.path.segments.inner                                                                     |
|  9 | json.items[NN].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty.Path.path.segments.last                                                                      |
|  9 | json.items[NN].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty.Path.path.segments.last.arguments                                                            |
|  9 | json.items[NN].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty.Path.path.segments.last.ident                                                                |
|  9 | json.items[NN].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.ty.Path.qself                                                                                   |
|  9 | json.items[NN].Enum.variants.inner[N][N].fields.Unnamed.unnamed.last.vis                                                                                             |
| 10 | json.items[N].Enum.variants.inner[N]                                                                                                                                 |
| 10 | json.items[N].Enum.variants.inner[N][N].attrs                                                                                                                        |
| 10 | json.items[N].Enum.variants.inner[N][N].discriminant                                                                                                                 |
| 10 | json.items[N].Enum.variants.inner[N][N].fields                                                                                                                       |
| 10 | json.items[N].Enum.variants.inner[N][N].ident                                                                                                                        |
| 10 | json.items[N].Enum.variants.inner[N][N].spans                                                                                                                        |
| 10 | json.items[NN].Enum                                                                                                                                                  |
| 10 | json.items[NN].Enum.attrs                                                                                                                                            |
| 10 | json.items[NN].Enum.brace_token                                                                                                                                      |
| 10 | json.items[NN].Enum.brace_token.span                                                                                                                                 |
| 10 | json.items[NN].Enum.enum_token                                                                                                                                       |
| 10 | json.items[NN].Enum.enum_token.span                                                                                                                                  |
| 10 | json.items[NN].Enum.generics                                                                                                                                         |
| 10 | json.items[NN].Enum.generics.gt_token                                                                                                                                |
| 10 | json.items[NN].Enum.generics.lt_token                                                                                                                                |
| 10 | json.items[NN].Enum.generics.params                                                                                                                                  |
| 10 | json.items[NN].Enum.generics.params.inner                                                                                                                            |
| 10 | json.items[NN].Enum.generics.params.last                                                                                                                             |
| 10 | json.items[NN].Enum.generics.where_clause                                                                                                                            |
| 10 | json.items[NN].Enum.ident                                                                                                                                            |
| 10 | json.items[NN].Enum.variants                                                                                                                                         |
| 10 | json.items[NN].Enum.variants.inner                                                                                                                                   |
| 10 | json.items[NN].Enum.variants.last                                                                                                                                    |
| 10 | json.items[NN].Enum.vis                                                                                                                                              |
| 10 | json.items[NN].Enum.vis.Public                                                                                                                                       |
| 10 | json.items[NN].Enum.vis.Public.span                                                                                                                                  |
| 15 | json.items[NN].Enum.attrs[N]                                                                                                                                         |
| 15 | json.items[NN].Enum.attrs[N].bracket_token                                                                                                                           |
| 15 | json.items[NN].Enum.attrs[N].bracket_token.span                                                                                                                      |
| 15 | json.items[NN].Enum.attrs[N].meta                                                                                                                                    |
| 15 | json.items[NN].Enum.attrs[N].meta.List                                                                                                                               |
| 15 | json.items[NN].Enum.attrs[N].pound_token                                                                                                                             |
| 15 | json.items[NN].Enum.attrs[N].pound_token.spans                                                                                                                       |
| 15 | json.items[NN].Enum.attrs[N].style                                                                                                                                   |
| 20 | json.items[N].Enum.variants.inner[N][N]                                                                                                                              |
| 27 | json.items[NN].Enum.variants.inner[N]                                                                                                                                |
| 27 | json.items[NN].Enum.variants.inner[N][N].attrs                                                                                                                       |
| 27 | json.items[NN].Enum.variants.inner[N][N].discriminant                                                                                                                |
| 27 | json.items[NN].Enum.variants.inner[N][N].fields                                                                                                                      |
| 27 | json.items[NN].Enum.variants.inner[N][N].ident                                                                                                                       |
| 27 | json.items[NN].Enum.variants.inner[N][N].spans                                                                                                                       |
| 54 | json.items[NN].Enum.variants.inner[N][N]                                                                                                                             |

We can translate the jq statements into rust compiler programs that run inside the
compiler or next to it in syn. we can show that they are equivalent.


We can do a one hot encoding of the json, then reduce the array indexes by replacing them with the types.
this abstration function maps objects into types. we can reverse this and also train a neural network to
do it.

In that system each string value gets mapped into an instance, in the context that it is created.
so two strings will have different paths like a flattened gron.

That way, abstractions are functions or maps. We can create arrows from the instances to the types.
